#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_iam_role.aws_lambda_cost will be created
  + resource "aws_iam_role" "aws_lambda_cost" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be created
  + resource "aws_lambda_function" "aws_lambda_cost" {
      + arn                            = (known after apply)
      + filename                       = "modules/aws-lambda-cost/lambda.zip"
      + function_name                  = "aws-lambda-cost"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SLACK_WEBHOOK" = "https://hooks.slack.com/services/XXXXXXXXXXXXXXXXXXXXXXXXXXX"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.aws-lambda-cost.null_resource.aws_lambda_cost will be created
  + resource "null_resource" "aws_lambda_cost" {
      + id       = (known after apply)
      + triggers = {
          + "source_code_hash" = "BVljnc9Pzm0Qzc2T13/GwJ3mhvN2p6FjPSYVlYPo3uM="
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
